In [1]:
%load_ext sql
import os
from sqlalchemy import create_engine

pgconfig = {
    'host': 'db',
    'port': os.environ['PG_PORT'],
    'database': os.environ['PG_DATABASE'],
    'user': os.environ['PG_USER'],
    'password': os.environ['PG_PASSWORD'],
}
dsl = 'postgresql://{user}:{password}@{host}:{port}/{database}'.format(**pgconfig)
conn = create_engine(dsl)

# MagicコマンドでSQLを書くための設定
%sql conn

In [3]:
%%sql
drop table if exists R;
CREATE TABLE R (
    char VARCHAR(10) NOT NULL,
    num INTEGER               
);

INSERT INTO R (char, num) VALUES
('apple', 1),
('banana', 5),
('cherry', 3),
('apple', 1);

*  postgresql://padawan:***@db:5432/dsdojo_db
Done.
Done.
4 rows affected.

[]

In [4]:
%%sql
SELECT * FROM R;

*  postgresql://padawan:***@db:5432/dsdojo_db
4 rows affected.

[('apple', 1), ('banana', 5), ('cherry', 3), ('apple', 1)]

In [7]:
%%sql
SELECT * FROM R UNION SELECT * FROM R;

*  postgresql://padawan:***@db:5432/dsdojo_db
3 rows affected.

[('banana', 5), ('apple', 1), ('cherry', 3)]

In [8]:
%%sql
SELECT * FROM R UNION ALL SELECT * FROM R;

*  postgresql://padawan:***@db:5432/dsdojo_db
8 rows affected.

[('apple', 1),
 ('banana', 5),
 ('cherry', 3),
 ('apple', 1),
 ('apple', 1),
 ('banana', 5),
 ('cherry', 3),
 ('apple', 1)]